tests/data-unused/get_order_data_request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><GetOrderData xmlns="https://www.pagador.com.br/query/pagadorquery"><orderDataRequest><RequestId>782a56e2-2dae-11e2-b3ee-080027d29772</RequestId><Version>1.0</Version><MerchantId>12345678-1234-1234-1234-1234567890AB</MerchantId><BraspagOrderId>5876143c-7a54-404d-ba5a-51a299e51cf7</BraspagOrderId></orderDataRequest></GetOrderData></soap:Body></soap:Envelope>